fix: mermaid add to doc
